{
 "status": "success",
 "result": [
  {
   "gen": "xy",
   "movesets": [
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "substitute",
         "name": "Substitute"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "leech_seed",
         "name": "Leech Seed"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "will-o-wisp",
         "name": "Will-O-Wisp"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "phantom_force",
         "name": "Phantom Force"
        },
        {
         "gen": "xy",
         "alias": "protect",
         "name": "Protect"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [
      {
       "gen": "xy",
       "alias": "frisk",
       "name": "Frisk"
      }
     ],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "RU",
       "alias": "ru",
       "name": "Rarelyused"
      }
     ],
     "name": "SubSeed",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 1.0,
       "hp": 1.0,
       "spatk": 0.9,
       "pdef": 1.0,
       "spe": 1.1
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Leftovers",
       "alias": "leftovers",
       "description": "Heals 1/16 of max HP each turn."
      }
     ],
     "evconfigs": [
      {
       "spdef": 0,
       "patk": 0,
       "hp": 152,
       "spatk": 0,
       "pdef": 132,
       "spe": 224
      }
     ],
     "description": "<h4>Moves</h4>\n<p>Substitute is used to avoid incoming attacks and stall for Leech Seed and Will-O-Wisp damage. Leech Seed can heal off most of the damage from Substitute when used with Leftovers and also wears down the opponent. Will-O-Wisp is used not only to cripple physical attackers, but also to wear down the opponent even more in combination with Leech Seed. Protect is used to stall for Leech Seed and Will-O-Wisp damage without having to take a hit like Gourgeist-S would with Phantom Force. Protect does, however, leave Gourgeist-S very vulnerable to Taunt. Phantom Force can be used in the last slot to stall for Leech Seed and Will-O-Wisp damage while also making sure that Gourgeist-S isn't complete Taunt bait. However, it gives Normal-type Pokemon, most notably Exploud, a free switch-in. Seed Bomb is an option, though it does pitiful amounts of damage to Grass-types which are immune to Leech Seed and Fire-types which are immune to Will-O-Wisp. Additionally, Seed Bomb doesn't give Gourgeist-S the ability to stall for Leech Seed and Will-O-Wisp damage.</p>\n<h4>Set Details</h4>\n<p>The EV spread with a Jolly nature allows Gourgeist-S to outspeed max Speed base 95 Speed Pokemon such as Drapion in order to use Will-O-Wisp, Leech Seed, or Substitute against them. The given HP EVs maximize Leech Seed recovery while also providing good bulk, with the leftover EVs being added to Defense to better take physical hits. Jolly is preferred if Phantom Force is being used; otherwise, a Timid nature is preferred to reduce Foul Play and confusion damage. Frisk is the ability of choice, as it lets Gourgeist-S scout the opponent's item. Leftovers is a necessity, as in combination with Leech Seed, it heals off much of the HP lost from using Substitute.</p>\n<h4>Usage Tips</h4>\n<p>Try to bring Gourgeist-S in on a slow Ground-, Water-, or Fighting-type that can't hurt it and set up a Substitute. From there, use the combination of Substitute, Leech Seed, Will-O-Wisp, and Protect or Phantom Force to slowly whittle away at the opponent's health. It's important to avoid Knock Off at all costs, as Leftovers recovery is a big part of what makes Gourgeist-S successful.</p>\n<h4>Team Options</h4>\n<p>Toxic Spikes support is amazing, as Gourgeist-S can stall entire teams with Leech Seed in combination with Toxic Spikes. Drapion not only sets up Toxic Spikes but can also take the Dark- and Ghost-type moves that Gourgeist-S hates. Weezing and Roselia are other Pokemon that can use Toxic Spikes. With no reliable recovery move, Gourgeist-S greatly appreciates Wish support. Alomomola and Aromatisse are two of the best Wish passers in the tier and also pair really well with Gourgeist-S: the former takes Fire- and Ice-type attacks for Gourgeist-S, while the latter can take Dark-type attacks with ease. Rhyperior is great at absorbing Fire- and Flying-type attacks for Gourgeist-S, while Gourgeist-S can take Water- and Grass-type moves for Rhyperior. Qwilfish has good synergy with Gourgeist-S, as it takes Fire- and Ice-type attacks for Gourgeist-S, while Gourgeist-S can take Ground- and Electric-type attacks for Qwilfish in return. Qwilfish can also set up Spikes to further wear down the opponent. Because Grass- and Fire-types are immune to Leech Seed and Will-O-Wisp, respectively, Pokemon that can deal with these types make for good partners. Slowking counters most Fire-types and also has a super effective STAB move to beat Amoonguss, and can even lure in other Grass-types with Fire Blast. Golbat 4x resists Grass-type moves and can retaliate back with Brave Bird. It can also clear entry hazards via Defog, helping to extend Gourgeist-S's lifespan.</p>\n"
    },
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "substitute",
         "name": "Substitute"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "leech_seed",
         "name": "Leech Seed"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "will-o-wisp",
         "name": "Will-O-Wisp"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "phantom_force",
         "name": "Phantom Force"
        },
        {
         "gen": "xy",
         "alias": "protect",
         "name": "Protect"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [
      {
       "gen": "xy",
       "alias": "frisk",
       "name": "Frisk"
      }
     ],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "NU",
       "alias": "nu",
       "name": "Neverused"
      }
     ],
     "name": "SubSeed",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 0.9,
       "hp": 1.0,
       "spatk": 1.0,
       "pdef": 1.0,
       "spe": 1.1
      },
      {
       "spdef": 1.0,
       "patk": 1.0,
       "hp": 1.0,
       "spatk": 0.9,
       "pdef": 1.0,
       "spe": 1.1
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Leftovers",
       "alias": "leftovers",
       "description": "Heals 1/16 of max HP each turn."
      }
     ],
     "evconfigs": [
      {
       "spdef": 0,
       "patk": 0,
       "hp": 152,
       "spatk": 0,
       "pdef": 132,
       "spe": 224
      }
     ],
     "description": "<h4>Moves</h4>\n<p>Substitute protects Gourgeist-Small from status and attacks, allowing it to stall for Leech Seed and burn damage. Leech Seed can not only deal good damage but also heal back some HP used to create a Substitute, making Gourgeist-Small hard to take down. Will-O-Wisp cripples physical attackers and wears down the opponent. Phantom Force is a STAB move that can stall for Leech Seed and burn damage while Gourgeist-Small has disappeared. Protect can also stall for burn and Leech Seed damage while not leaving Gourgeist-Small vulnerable like Phantom Force does on the turn it hits. However, it does no damage and leaves Gourgeist-Small vulnerable to Taunt. Rock Slide is another option to deal super effective damage to Fire-, Ice-, and Flying-types such as Chatot and Xatu which can normally deal with Gourgeist-Small. It also has a good chance to flinch, which can help Gourgeist-Small in stalling.</p>\n<h4>Set Details</h4>\n<p>The EV spread allows Gourgeist-Small to outspeed max Speed base 95s such as Electivire, Primeape, and Jynx, with the HP EVs allowing for as much Leech Seed and Leftovers recovery as possible. The remaining EVs are put in Defense to allow Gourgeist-Small to better tank hits. A Jolly nature should be used if Phantom Force or Rock Slide is chosen; otherwise, a Timid nature is a better option to minimize Foul Play and confusion damage. Leftovers is a great item that can help Gourgeist-Small heal off Substitute damage, and it is especially effective in combination with Leech Seed. Frisk is the ability of choice as it scouts the opponent's item and is the only ability Gourgeist-Small can put to any good use.</p>\n<h4>Usage Tips</h4>\n<p>Gourgeist-Small should try to set up a Substitute on a Pokemon it walls, such as Golem, then proceed to use the combination of Substitute, Leech Seed, Will-O-Wisp, and Phantom Force or Protect to stall out the opponent. Try to avoid Knock Off at all costs, as the loss of Leftovers can be detrimental to Gourgeist-S's performance.</p>\n<h4>Team Options</h4>\n<p>Audino and Lickilicky can pass Wishes to Gourgeist-Small to help make up for its lack of reliable recovery, as well as provide Heal Bell support in case Gourgeist-Small gets statused. Toxic Spikes support from Dragalge and Qwilfish can really help Gourgeist-Small stall, as it means Pokemon will be instantly statused as they switch in. Synergy-wise, Rhydon can take Fire- and Flying-type attacks for Gourgeist-Small while also setting up Stealth Rock, while Poliwrath can take Dark-, Ice-, and Fire-type attacks. Gourgeist-Small can also take on the Grass-, Water-, Ground-, and Fighting-type attacks Rhydon is weak to, while it can take on Electric- and Grass-type attacks for Poliwrath. Pokemon to deal with the Fire- and Grass-types immune to Will-O-Wisp and Leech Seed are helpful. Dragalge can wall Pokemon of both types, while Flareon and Camerupt can both deal with both Fire- and Grass-types well.</p>\n"
    },
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "will-o-wisp",
         "name": "Will-O-Wisp"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "leech_seed",
         "name": "Leech Seed"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "substitute",
         "name": "Substitute"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "protect",
         "name": "Protect"
        },
        {
         "gen": "xy",
         "alias": "seed_bomb",
         "name": "Seed Bomb"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [
      {
       "gen": "xy",
       "alias": "frisk",
       "name": "Frisk"
      }
     ],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "OU",
       "alias": "ou",
       "name": "Overused"
      }
     ],
     "name": "SubSeed",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 0.9,
       "hp": 1.0,
       "spatk": 1.0,
       "pdef": 1.0,
       "spe": 1.1
      },
      {
       "spdef": 1.0,
       "patk": 1.0,
       "hp": 1.0,
       "spatk": 0.9,
       "pdef": 1.0,
       "spe": 1.1
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Leftovers",
       "alias": "leftovers",
       "description": "Heals 1/16 of max HP each turn."
      }
     ],
     "evconfigs": [
      {
       "spdef": 0,
       "patk": 0,
       "hp": 252,
       "spatk": 0,
       "pdef": 32,
       "spe": 224
      }
     ],
     "description": "<h4>Moves</h4>\n<p>Will-O-Wisp lets Gourgeist-S neuter physical attackers hoping to dent it and can quickly wear down defensive Pokemon like Mega Venusaur. Leech Seed is its main source of healing as well as another source of passive damage that forces plenty of switches. Substitute turns Gourgeist-S into an annoying and effective SubSeeder, scouting out moves and offering it a layer of protection against status effects and strong attacks while also easing prediction. The last move is a toss-up between Protect and Seed Bomb. The former can be used to rack up passive damage with Leech Seed and Will-O-Wisp, as well as add some mind games to the battle, which can leave you in a very advantageous position. Protect, when combined with Frisk, turns Gourgeist-S into an amazing scout, informing you of items and the move the opponent is locked into if they are holding a Choice item. This allows you to respond accordingly without needing any prediction. Seed Bomb can be used if being total Taunt bait bothers you (although Gourgeist-S is pretty much Taunt bait either way). Pain Split deserves a mention for offering semi-reliable recovery and making Gourgeist-S incredibly annoying against stall teams, but any free turns are best spent using one of the first 3 moves anyway.</p>\n<h4>Set Details</h4>\n<p>224 Speed EVs are used to outpace max Speed Kyurem-B with the rest dumped into HP and Defense. Frisk, in conjunction with Protect, turns Gourgeist-S into an amazing scout, allowing it to discover possible Choice items and use Protect to scout moves, enabling you to respond accordingly. Leftovers is mandatory as passive recovery allows Gourgeist-S to cope with passive damage and compensates for its lack of reliable recovery. A spread with max Speed to outpace and stall out Hydreigon with Substitute and Leech Seed is an option, but it's rarely worth it as Hydreigon is fairly uncommon.</p>\n<h4>Usage Tips</h4>\n<p>This set aims to switch in on resisted hits and use whichever of the first three moves listed put you in the best position. While Leech Seed and Will-O-Wisp are great moves to annoy the opposing team, if they have Pokemon such as Heatran or Mega Venusaur to absorb one of the moves and threaten Gourgeist-S out, you should refrain from using them. A better play would be to double switch or just scout with Substitute or Protect. Speaking of Protect, use it wisely, as a skilled player can predict when you use it and use the free turn to either switch or set up. Substitute protects Gourgeist-S from Pokemon such as Rotom-W and Chansey that are only threatening through status, so get a Substitute up against them first. Getting a Substitute up on anything that commonly carries status moves should come before anything else, because Gourgeist-S really hates being burned or poisoned. Use Frisk to your advantage by bringing Gourgeist-S in on physical attackers that it can handle so that you can safely discover their item. Finally, even if it means sacrificing Gourgeist-S, don't be afraid to burn a crucial threat like Kyurem-B or Bisharp.</p>\n<h4>Team Options</h4>\n<p>Gourgeist-S is a superb spinblocker, so pair it with entry hazard setters, such as Azelf. Bisharp discourages Defog, and Gourgeist-S can take the Fighting- and Ground-type attacks aimed at Bisharp. Gourgeist-S has subpar Special Defense, so pairing it with special tanks such as Heatran and Tyranitar can patch up its weaknesses. Gourgeist-S has excellent synergy with Tyranitar in particular, taking Fighting- and Ground-type moves, as well as weaker Bug- and Steel-type moves, for Tyranitar, while Tyranitar can take Fire-, Flying-, Ghost-, and Dark-type moves aimed at Gourgeist-S. Gourgeist-S also hates status, so pairing it with a cleric such as Sylveon or Chansey that can take special hits is a good idea. In return, the Pokemon that have been burned by Gourgeist-S will be much easier to take on by these clerics. Fire-type sweepers such as Mega Charizard X and Talonflame can come in and set up on Gourgeist-S easily if they have Roost, so have a good response to them, such as Landorus-T.</p>\n"
    }
   ],
   "alias": "gourgeist-small",
   "name": "Gourgeist-Small",
   "genfamily": [
    {
     "gen": "xy",
     "alias": "gourgeist-small"
    }
   ],
   "moves": [],
   "family": {
    "preevo": {
     "gen": "xy",
     "alias": "pumpkaboo-small",
     "name": "Pumpkaboo-Small"
    },
    "evos": [
     {
      "preevo": {
       "gen": "xy",
       "alias": "gourgeist-small",
       "name": "Gourgeist-Small"
      },
      "evos": []
     }
    ]
   },
   "alts": [
    {
     "patk": 85,
     "height": 0.0,
     "abilities": [
      {
       "gen": "xy",
       "name": "Frisk",
       "alias": "frisk",
       "description": "Reveals the foe's items."
      },
      {
       "gen": "xy",
       "name": "Insomnia",
       "alias": "insomnia",
       "description": "Prevents sleep."
      },
      {
       "gen": "xy",
       "name": "Pickup",
       "alias": "pickup",
       "description": "If the wielder has no held item, it gets the last item consumed at the end of the turn. Adds a chance of finding an item after each battle."
      }
     ],
     "alias": "gourgeist-small",
     "tags": [
      {
       "gen": "xy",
       "shorthand": "NU",
       "alias": "nu",
       "name": "Neverused"
      }
     ],
     "types": [
      {
       "gen": "xy",
       "alias": "ghost",
       "name": "Ghost"
      },
      {
       "gen": "xy",
       "alias": "grass",
       "name": "Grass"
      }
     ],
     "gkpower": 20,
     "spdef": 75,
     "hp": 55,
     "spatk": 58,
     "suffix": "",
     "pdef": 122,
     "weight": 0.0,
     "spe": 99,
     "effectives": [
      {
       "types": [
        {
         "gen": "xy",
         "alias": "fighting",
         "name": "Fighting"
        },
        {
         "gen": "xy",
         "alias": "normal",
         "name": "Normal"
        }
       ],
       "modifier": 0.0
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "electric",
         "name": "Electric"
        },
        {
         "gen": "xy",
         "alias": "grass",
         "name": "Grass"
        },
        {
         "gen": "xy",
         "alias": "ground",
         "name": "Ground"
        },
        {
         "gen": "xy",
         "alias": "water",
         "name": "Water"
        }
       ],
       "modifier": 0.5
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "bug",
         "name": "Bug"
        },
        {
         "gen": "xy",
         "alias": "dragon",
         "name": "Dragon"
        },
        {
         "gen": "xy",
         "alias": "fairy",
         "name": "Fairy"
        },
        {
         "gen": "xy",
         "alias": "poison",
         "name": "Poison"
        },
        {
         "gen": "xy",
         "alias": "psychic",
         "name": "Psychic"
        },
        {
         "gen": "xy",
         "alias": "rock",
         "name": "Rock"
        },
        {
         "gen": "xy",
         "alias": "steel",
         "name": "Steel"
        }
       ],
       "modifier": 1.0
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "dark",
         "name": "Dark"
        },
        {
         "gen": "xy",
         "alias": "fire",
         "name": "Fire"
        },
        {
         "gen": "xy",
         "alias": "flying",
         "name": "Flying"
        },
        {
         "gen": "xy",
         "alias": "ghost",
         "name": "Ghost"
        },
        {
         "gen": "xy",
         "alias": "ice",
         "name": "Ice"
        }
       ],
       "modifier": 2.0
      }
     ]
    }
   ]
  }
 ]
}