{
 "status": "success",
 "result": [
  {
   "gen": "xy",
   "movesets": [
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "rest",
         "name": "Rest"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "sleep_talk",
         "name": "Sleep Talk"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "sacred_sword",
         "name": "Sacred Sword"
        },
        {
         "gen": "xy",
         "alias": "shadow_claw",
         "name": "Shadow Claw"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "gyro_ball",
         "name": "Gyro Ball"
        },
        {
         "gen": "xy",
         "alias": "toxic",
         "name": "Toxic"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [
      {
       "gen": "xy",
       "alias": "no_guard",
       "name": "No Guard"
      }
     ],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "UU",
       "alias": "uu",
       "name": "Underused"
      }
     ],
     "name": "RestTalk",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 1.0,
       "hp": 1.0,
       "spatk": 1.0,
       "pdef": 1.1,
       "spe": 0.9
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Eviolite",
       "alias": "eviolite",
       "description": "Boosts Defense and Special Defense of holder by 50% if it is an NFE Pokemon."
      }
     ],
     "evconfigs": [
      {
       "spdef": 16,
       "patk": 0,
       "hp": 240,
       "spatk": 0,
       "pdef": 252,
       "spe": 0
      }
     ],
     "description": "<h4>Moves</h4>\n<p>Rest and Sleep Talk allow Doublade to rid itself of status afflictions and recover its HP completely, while not being totally useless when asleep. Shadow Claw is preferred over Shadow Sneak as Sleep Talk still has normal priority, but Shadow Sneak can be used while awake for priority. Sacred Sword can also be used, as it hits more targets super effectively. Gyro Ball is still Doublade's strongest STAB move due to its low Speed and high Attack. Alternatively, Toxic can be used to rack up residual damage on switch-ins and stall out some Pokemon.</p>\n<h4>Set Details</h4>\n<p>240 EVs in HP reduce entry hazard and burn damage. 252 EVs in Defense allow Doublade to take literally any physical attack. The remaining EVs are placed in Special Defense to try and give Doublade a little more bulk on the special side. A Relaxed nature boosts its Defense while lowering its Speed, powering up Gyro Ball. Eviolite boosts Doublade's Defense up to insane levels while somewhat patching up its lackluster Special Defense. 0 Speed IVs power up Gyro Ball and allow Doublade to 'outspeed' most Pokemon under Trick Room.</p>\n<h4>Usage Tips</h4>\n<p>Trick Room is helpful, as a lucky critical hit could mean the difference between getting off a Rest or dying. It's also useful since Doublade runs 0 Speed IVs and usually needs to take a hit before being able to move. Keep in mind that the Fighting-types that Doublade can usually check now often carry Knock Off, which can cripple it by removing its Eviolite. Even with the increased bulk, you should still scout for mixed sets, super effective coverage moves, and special attackers in general that can still muscle past this set provided they are not weak to one of Doublade's attacks.</p>\n<h4>Team Options</h4>\n<p>Similar to the Swords Dance Tank set, this physically inclined set still appreciates specially defensive walls such as Assault Vest Meleotta (which can also apply offensive pressure), specially defensive Porygon2, Florges, and Umbreon. Wish passers are no longer as necessary due to RestTalk, but they still helpful during situations where Doublade is asleep with a low amount of health. Water-types, Flying-types, and Levitate users make great teammates, as they resist Doublade's common weaknesses. Trick Room setters are useful, allowing Doublade to move first and stall much better. Again, Hydreigon is a fantastic teammate, as the two resist each other's weaknesses, forming a solid core.</p>\n"
    },
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "swords_dance",
         "name": "Swords Dance"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "shadow_claw",
         "name": "Shadow Claw"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "iron_head",
         "name": "Iron Head"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "shadow_sneak",
         "name": "Shadow Sneak"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [
      {
       "gen": "xy",
       "alias": "no_guard",
       "name": "No Guard"
      }
     ],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "RU",
       "alias": "ru",
       "name": "Rarelyused"
      }
     ],
     "name": "Swords Dance",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 1.1,
       "hp": 1.0,
       "spatk": 0.9,
       "pdef": 1.0,
       "spe": 1.0
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Eviolite",
       "alias": "eviolite",
       "description": "Boosts Defense and Special Defense of holder by 50% if it is an NFE Pokemon."
      }
     ],
     "evconfigs": [
      {
       "spdef": 0,
       "patk": 252,
       "hp": 212,
       "spatk": 0,
       "pdef": 0,
       "spe": 44
      }
     ],
     "description": "<h4>Moves</h4>\n<p>Swords Dance lets Doublade boost its already high Attack stat to dangerous levels, letting it break through bulkier Pokemon more easily while simultaneously boosting the power of its Shadow Sneak to the point that it can cleave through faster, frailer threats such as Delphox and Jolteon. Doublade's excellent bulk and typing make it quite easy to set up a Swords Dance as well. Shadow Claw is Doublade's main STAB move, possessing a solid 70 Base Power and hitting everything except Normal- and Dark-type Pokemon neutrally, making it quite spammable. Meanwhile, Iron Head is Doublade's strongest reliable STAB move and hits several Pokemon that Doublade can't touch with its Shadow Claw hard, including Rhyperior, Aromatisse, Drapion, and Braviary. Lastly, Shadow Sneak gives Doublade a valuable priority move, allowing it to pick off frail or weakened threats and temporarily bypass its low Speed stat while attempting to sweep late-game.</p>\n<h4>Set Details</h4>\n<p>The given EV spread and Adamant nature aim to maximize Doublade's bulk and power while giving it enough Speed to outpace 0 Speed Rhyperior and smack it with an Iron Head before it can use Earthquake, which is especially useful when trying to sweep with a Swords Dance boost. Eviolite is used to bolster Doublade's already excellent physical bulk to astounding levels, while also boosting its low Special Defense into a more acceptable range.</p>\n<h4>Usage Tips</h4>\n<p>Doublade is a delightfully simple Pokemon to use; just switch it in on one of the many physical attackers that it walls, then either attack the opposition right off the bat or set up with Swords Dance to attempt a sweep. Just remember that you shouldn't always try and sweep with Doublade early-game as most teams will have a way to stop Doublade from simply running through their team, so trying to set up a Swords Dance right away usually isn't the best play; instead try and use Doublade more defensively early-game, switching into various physical attackers, launching an unboosted attack to wear the opponent down, and then switching out as soon as possible. Also keep in mind that while you should try and keep Doublade away from Knock Off as much as possible, its not the end of the world if you absolutely have to take one to stop an opponent; Doublade is still quite bulky on the physical side even without an Eviolite boost.</p>\n<h4>Team Options</h4>\n<p>Doublade works excellently with entry hazards of any form, as not only does it spinblock these hazards effectively thanks to its Ghost typing, but it also heavily benefits from them being set up itself, as the residual damage makes it that much easier for Doublade to sweep late-game with a Swords Dance boost. As Doublade lacks any recovery of its own, more defensive teams opting to use Doublade as their spinblocker should consider Wish support to help keep it healthy throughout the game. Good examples of Pokemon that can provide this kind of support include Alomomola and Aromatisse. As Doublade's Special Defense is quite middling even with an Eviolite boost, Pokemon that can take these kinds of moves for Doublade such as Slowking, Aromatisse, Virizion, and Druddigon make good teammates. Lastly, Fighting-type Pokemon such as Hitmonlee, Hitmontop, and Emboar pair quite well with Doublade, threatening the various Dark- and Normal-types that can hinder Doublade's sweep with ease, while Doublade can set up on annoyances for these Pokemon such as Cresselia and Braviary in return.</p>\n"
    },
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "swords_dance",
         "name": "Swords Dance"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "gyro_ball",
         "name": "Gyro Ball"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "sacred_sword",
         "name": "Sacred Sword"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "shadow_sneak",
         "name": "Shadow Sneak"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [
      {
       "gen": "xy",
       "alias": "no_guard",
       "name": "No Guard"
      }
     ],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "UU",
       "alias": "uu",
       "name": "Underused"
      }
     ],
     "name": "Swords Dance Tank",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 1.1,
       "hp": 1.0,
       "spatk": 1.0,
       "pdef": 1.0,
       "spe": 0.9
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Eviolite",
       "alias": "eviolite",
       "description": "Boosts Defense and Special Defense of holder by 50% if it is an NFE Pokemon."
      }
     ],
     "evconfigs": [
      {
       "spdef": 16,
       "patk": 252,
       "hp": 240,
       "spatk": 0,
       "pdef": 0,
       "spe": 0
      }
     ],
     "description": "<h4>Moves</h4>\n<p>Doublade generally gets multiple opportunities to use Swords Dance, as it forces many physical attackers out and can take hits relatively well. Gyro Ball is Doublade's main STAB move, as it hits very hard when factoring in its low Speed and high Attack. Sacred Sword provides valuable coverage against the Steel- and Dark-types that resist Gyro Ball. Shadow Sneak gives Doublade a way to finish off weakened opponents and rounds off Doublade's perfect neutral coverage with a STAB priority move. Some alternative moves can be used, such as Rock Slide to dent Flying-types and common Fire-types on the switch, Shadow Claw for the extra power, or Aerial Ace to take care of Fighting-types that will switch in to try and use Knock Off.</p>\n<h4>Set Details</h4>\n<p>240 HP EVs gives Doublade a Stealth Rock number while minimizing burn damage. 252 EVs in Attack are used to maximize Doublade's offensive capabilities. The remaining EVs are placed in Special Defense since Speed is actually detrimental, and Doublade's Defense is already insanely high. A Brave nature is used to boost Doublade's Attack while lowering its Speed to power up Gyro Ball. Eviolite is mandatory, turning Doublade into a physical juggernaut. No Guard is the only ability available to Doublade. 0 Speed IVs further increase Gyro Ball's power.</p>\n<h4>Usage Tips</h4>\n<p>Doublade can switch in on most physical attacks, even weaker super effective ones. However, keep it away from special attackers, as even resisted hits can put dents in it. Doublade also loathes Knock Off, which hits it super effectively and removes its precious Eviolite. Scout for potential coverage moves on opponents, such as Earthquake, Shadow Ball, and the aforementioned Knock Off. In addition to this, scout for mixed sets on offensive Pokemon such as Sharpedo and Hydreigon.</p>\n<h4>Team Options</h4>\n<p>Doublade desperately needs a special wall to alleviate its lack of Special Defense; examples include Assault Vest Meleotta (which can also apply offensive pressure), specially defensive Porygon2, Florges, and Umbreon. Doublade also lacks any form of recovery, so Wish passers such as Aromatisse, Florges, Alomomola and Umbreon make great teammates, prolonging Doublade's time on the field. Doublade appreciates status absorbers or Fire-types to switch into Will-O-Wisps, as a burn will severely limit both its offensive and defensive capabilities. Flying-types or Levitate users, especially ones that resist Fire-type moves, such as Flygon, Rotom-H, and Aerodactyl make great teammates. Bulky Water-types such as Vaporeon, Suicune, and Swampert can take Fire- and Ground-type moves aimed at Doublade and threaten back with a STAB move. Pokemon that can set up Trick Room give Doublade an opportunity to sweep by 'outspeeding' most Pokemon under Trick Room. Hydreigon is possibly Doublade's best teammate, as the pair resist each other's weaknesses while hitting from both the physical and special sides.</p>\n"
    }
   ],
   "alias": "doublade",
   "name": "Doublade",
   "genfamily": [
    {
     "gen": "xy",
     "alias": "doublade"
    }
   ],
   "moves": [
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "flying",
      "name": "Flying"
     },
     "accuracy": 0,
     "alias": "aerial_ace",
     "name": "Aerial Ace",
     "description": "Ignores accuracy modifiers.",
     "pp": 20,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "attract",
     "name": "Attract",
     "description": "Targets of the opposite gender are infatuated and have a 50% chance to do nothing.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "steel",
      "name": "Steel"
     },
     "accuracy": 0,
     "alias": "autotomize",
     "name": "Autotomize",
     "description": "Boosts user's Speed by 2 stages. Reduces user's weight.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "fighting",
      "name": "Fighting"
     },
     "accuracy": 100,
     "alias": "brick_break",
     "name": "Brick Break",
     "description": "Destroys Light Screen and Reflect, then hits.",
     "pp": 15,
     "power": 75
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "confide",
     "name": "Confide",
     "description": "Lowers the target's Special Attack by 1 stage.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 95,
     "alias": "cut",
     "name": "Cut",
     "description": "No additional effect.",
     "pp": 30,
     "power": 50
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "ghost",
      "name": "Ghost"
     },
     "accuracy": 0,
     "alias": "destiny_bond",
     "name": "Destiny Bond",
     "description": "If the user faints, the foe faints.",
     "pp": 5,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "double_team",
     "name": "Double Team",
     "description": "Boosts evasion by 1 stage.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "facade",
     "name": "Facade",
     "description": "Has 140 Base Power when burned, paralyzed, or poisoned.",
     "pp": 20,
     "power": 70
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "false_swipe",
     "name": "False Swipe",
     "description": "Always leaves the foe with at least 1 HP.",
     "pp": 40,
     "power": 40
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "steel",
      "name": "Steel"
     },
     "accuracy": 100,
     "alias": "flash_cannon",
     "name": "Flash Cannon",
     "description": "10% chance to lower Special Defense by 1 stage.",
     "pp": 10,
     "power": 80
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "frustration",
     "name": "Frustration",
     "description": "No additional effect.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "bug",
      "name": "Bug"
     },
     "accuracy": 95,
     "alias": "fury_cutter",
     "name": "Fury Cutter",
     "description": "Power doubles with each consecutive hit.",
     "pp": 20,
     "power": 40
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "steel",
      "name": "Steel"
     },
     "accuracy": 100,
     "alias": "gyro_ball",
     "name": "Gyro Ball",
     "description": "Does damage based on the foe's Speed and the user's Speed.",
     "pp": 5,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "bug",
      "name": "Bug"
     },
     "accuracy": 100,
     "alias": "hidden_power_bug",
     "name": "Hidden Power Bug",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "dark",
      "name": "Dark"
     },
     "accuracy": 100,
     "alias": "hidden_power_dark",
     "name": "Hidden Power Dark",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "dragon",
      "name": "Dragon"
     },
     "accuracy": 100,
     "alias": "hidden_power_dragon",
     "name": "Hidden Power Dragon",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "electric",
      "name": "Electric"
     },
     "accuracy": 100,
     "alias": "hidden_power_electric",
     "name": "Hidden Power Electric",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "fighting",
      "name": "Fighting"
     },
     "accuracy": 100,
     "alias": "hidden_power_fighting",
     "name": "Hidden Power Fighting",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "fire",
      "name": "Fire"
     },
     "accuracy": 100,
     "alias": "hidden_power_fire",
     "name": "Hidden Power Fire",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "flying",
      "name": "Flying"
     },
     "accuracy": 100,
     "alias": "hidden_power_flying",
     "name": "Hidden Power Flying",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "ghost",
      "name": "Ghost"
     },
     "accuracy": 100,
     "alias": "hidden_power_ghost",
     "name": "Hidden Power Ghost",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "hidden_power_grass",
     "name": "Hidden Power Grass",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "ground",
      "name": "Ground"
     },
     "accuracy": 100,
     "alias": "hidden_power_ground",
     "name": "Hidden Power Ground",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "ice",
      "name": "Ice"
     },
     "accuracy": 100,
     "alias": "hidden_power_ice",
     "name": "Hidden Power Ice",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "poison",
      "name": "Poison"
     },
     "accuracy": 100,
     "alias": "hidden_power_poison",
     "name": "Hidden Power Poison",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 100,
     "alias": "hidden_power_psychic",
     "name": "Hidden Power Psychic",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "rock",
      "name": "Rock"
     },
     "accuracy": 100,
     "alias": "hidden_power_rock",
     "name": "Hidden Power Rock",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "steel",
      "name": "Steel"
     },
     "accuracy": 100,
     "alias": "hidden_power_steel",
     "name": "Hidden Power Steel",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "water",
      "name": "Water"
     },
     "accuracy": 100,
     "alias": "hidden_power_water",
     "name": "Hidden Power Water",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "steel",
      "name": "Steel"
     },
     "accuracy": 0,
     "alias": "iron_defense",
     "name": "Iron Defense",
     "description": "Boosts Defense by 2 stages.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "steel",
      "name": "Steel"
     },
     "accuracy": 100,
     "alias": "iron_head",
     "name": "Iron Head",
     "description": "30% chance to flinch.",
     "pp": 15,
     "power": 80
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "steel",
      "name": "Steel"
     },
     "accuracy": 85,
     "alias": "metal_sound",
     "name": "Metal Sound",
     "description": "Lower's Special Defense by 2 stages.",
     "pp": 40,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "dark",
      "name": "Dark"
     },
     "accuracy": 100,
     "alias": "night_slash",
     "name": "Night Slash",
     "description": "Has a high critical hit rate.",
     "pp": 15,
     "power": 70
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 0,
     "alias": "power_trick",
     "name": "Power Trick",
     "description": "Swaps user's Attack and Defense stats.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "protect",
     "name": "Protect",
     "description": "Prevents anything from working on the user that turn.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "dark",
      "name": "Dark"
     },
     "accuracy": 100,
     "alias": "pursuit",
     "name": "Pursuit",
     "description": "Doubles in power if the target switches, and hits them before they can escape.",
     "pp": 20,
     "power": 40
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "water",
      "name": "Water"
     },
     "accuracy": 0,
     "alias": "rain_dance",
     "name": "Rain Dance",
     "description": "Summons rain for 5 turns.",
     "pp": 5,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 0,
     "alias": "reflect",
     "name": "Reflect",
     "description": "Lowers damage from physical attacks for 5 turns.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 0,
     "alias": "rest",
     "name": "Rest",
     "description": "The user goes to sleep for two turns and restores all HP.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "retaliate",
     "name": "Retaliate",
     "description": "Power doubles if the user's teammate fainted the previous turn.",
     "pp": 5,
     "power": 70
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "return",
     "name": "Return",
     "description": "No additional effect.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "rock",
      "name": "Rock"
     },
     "accuracy": 90,
     "alias": "rock_slide",
     "name": "Rock Slide",
     "description": "30% chance to flinch.",
     "pp": 10,
     "power": 75
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "fighting",
      "name": "Fighting"
     },
     "accuracy": 100,
     "alias": "rock_smash",
     "name": "Rock Smash",
     "description": "50% chance to lower Defense by 1 stage.",
     "pp": 15,
     "power": 40
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "fighting",
      "name": "Fighting"
     },
     "accuracy": 100,
     "alias": "sacred_sword",
     "name": "Sacred Sword",
     "description": "Ignores the target's stat changes.",
     "pp": 15,
     "power": 90
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "ghost",
      "name": "Ghost"
     },
     "accuracy": 100,
     "alias": "shadow_claw",
     "name": "Shadow Claw",
     "description": "Has a high critical hit rate.",
     "pp": 15,
     "power": 70
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "ghost",
      "name": "Ghost"
     },
     "accuracy": 100,
     "alias": "shadow_sneak",
     "name": "Shadow Sneak",
     "description": "The user always attacks first.",
     "pp": 30,
     "power": 40
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "slash",
     "name": "Slash",
     "description": "Has a high critical hit rate.",
     "pp": 20,
     "power": 70
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "sleep_talk",
     "name": "Sleep Talk",
     "description": "Picks one of the user's moves at random. Can only be used while sleeping.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "substitute",
     "name": "Substitute",
     "description": "Takes 1/4 the user's max HP to create a Substitute that takes damage for the user.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 90,
     "alias": "swagger",
     "name": "Swagger",
     "description": "Confuses the target. Boosts its Attack by 2 stages.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "swords_dance",
     "name": "Swords Dance",
     "description": "Boosts Attack by 2 stages.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "tackle",
     "name": "Tackle",
     "description": "No additional effect.",
     "pp": 35,
     "power": 50
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "poison",
      "name": "Poison"
     },
     "accuracy": 90,
     "alias": "toxic",
     "name": "Toxic",
     "description": "Inflicts intensifying poison on the target.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "rock",
      "name": "Rock"
     },
     "accuracy": 0,
     "alias": "wide_guard",
     "name": "Wide Guard",
     "description": "Protects user and allies from multi-target attacks.",
     "pp": 10,
     "power": 0
    }
   ],
   "family": {
    "preevo": {
     "gen": "xy",
     "alias": "honedge",
     "name": "Honedge"
    },
    "evos": [
     {
      "preevo": {
       "gen": "xy",
       "alias": "doublade",
       "name": "Doublade"
      },
      "evos": [
       {
        "preevo": {
         "gen": "xy",
         "alias": "aegislash",
         "name": "Aegislash"
        },
        "evos": []
       }
      ]
     }
    ]
   },
   "alts": [
    {
     "patk": 110,
     "height": 0.8,
     "abilities": [
      {
       "gen": "xy",
       "name": "No Guard",
       "alias": "no_guard",
       "description": "All attacks used by and used on this Pokemon will never miss."
      }
     ],
     "alias": "doublade",
     "tags": [
      {
       "gen": "xy",
       "shorthand": "RU",
       "alias": "ru",
       "name": "Rarelyused"
      }
     ],
     "types": [
      {
       "gen": "xy",
       "alias": "ghost",
       "name": "Ghost"
      },
      {
       "gen": "xy",
       "alias": "steel",
       "name": "Steel"
      }
     ],
     "gkpower": 20,
     "spdef": 49,
     "hp": 59,
     "spatk": 45,
     "suffix": "",
     "pdef": 150,
     "weight": 4.5,
     "spe": 35,
     "effectives": [
      {
       "types": [
        {
         "gen": "xy",
         "alias": "fighting",
         "name": "Fighting"
        },
        {
         "gen": "xy",
         "alias": "normal",
         "name": "Normal"
        },
        {
         "gen": "xy",
         "alias": "poison",
         "name": "Poison"
        }
       ],
       "modifier": 0.0
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "bug",
         "name": "Bug"
        }
       ],
       "modifier": 0.25
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "dragon",
         "name": "Dragon"
        },
        {
         "gen": "xy",
         "alias": "fairy",
         "name": "Fairy"
        },
        {
         "gen": "xy",
         "alias": "flying",
         "name": "Flying"
        },
        {
         "gen": "xy",
         "alias": "grass",
         "name": "Grass"
        },
        {
         "gen": "xy",
         "alias": "ice",
         "name": "Ice"
        },
        {
         "gen": "xy",
         "alias": "psychic",
         "name": "Psychic"
        },
        {
         "gen": "xy",
         "alias": "rock",
         "name": "Rock"
        },
        {
         "gen": "xy",
         "alias": "steel",
         "name": "Steel"
        }
       ],
       "modifier": 0.5
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "electric",
         "name": "Electric"
        },
        {
         "gen": "xy",
         "alias": "water",
         "name": "Water"
        }
       ],
       "modifier": 1.0
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "dark",
         "name": "Dark"
        },
        {
         "gen": "xy",
         "alias": "fire",
         "name": "Fire"
        },
        {
         "gen": "xy",
         "alias": "ghost",
         "name": "Ghost"
        },
        {
         "gen": "xy",
         "alias": "ground",
         "name": "Ground"
        }
       ],
       "modifier": 2.0
      }
     ]
    }
   ]
  }
 ]
}