{
 "status": "success",
 "result": [
  {
   "gen": "xy",
   "movesets": [
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "seed_flare",
         "name": "Seed Flare"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "air_slash",
         "name": "Air Slash"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "earth_power",
         "name": "Earth Power"
        },
        {
         "gen": "xy",
         "alias": "hidden_power_fire",
         "name": "Hidden Power Fire"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "healing_wish",
         "name": "Healing Wish"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "Uber",
       "alias": "uber",
       "name": "Uber"
      }
     ],
     "name": "All-Out Attacker",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 0.9,
       "hp": 1.0,
       "spatk": 1.0,
       "pdef": 1.0,
       "spe": 1.1
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Life Orb",
       "alias": "life_orb",
       "description": "Boosts power by 30%, user takes 10% recoil each turn it attacks."
      }
     ],
     "evconfigs": [
      {
       "spdef": 4,
       "patk": 0,
       "hp": 0,
       "spatk": 252,
       "pdef": 0,
       "spe": 252
      }
     ],
     "description": "<h4>Moves</h4>\n<p>When equipped with Life Orb, Shaymin-S can be a dangerous attacker capable of fending for itself when needed. Seed Flare deals good damage with the boost from Life Orb, and nothing likes switching into it in fear of a Special Defense drop. Earth Power is Shaymin-S's main move for defeating Steel-types that wall its STAB combination, and has a 20% chance to lower the opponent's Special Defense. Hidden Power Fire can be run so that Shaymin-S can defeat Steel-types such as Ferrothorn, Forretress, and Scizor that don't care too much about Earth Power. If Shaymin-S is not useful or cannot deal enough damage to the opponent, it can utilize Healing Wish, a support move that only a few Pokemon have access to. Healing Wish allows Shaymin-S to sacrifice itself in order to restore a damaged sweeper, pivot, or revenge killer to full health. Though unlisted, Hidden Power Rock allows Shaymin-S to heavily damage or KO Ho-Oh, and can reliably damage other Flying-types due to the boost from Life Orb.</p>\n<h4>Set Details</h4>\n<p>With a Timid nature, Shaymin-S outspeeds most of the unboosted tier, and with Life Orb, its damage output is very acceptable. A Modest nature can be used for additional power, but doing so sacrifices Shaymin-S's ability to outspeed max Speed Arceus formes and Darkrai. In terms of EVs, Shaymin-S should not deviate from the given spread, as its Speed and power are too precious to give up.</p>\n<h4>Usage Tips</h4>\n<p>When attacking, don't be afraid to mispredict with Shaymin-S's STAB moves, as they are extremely spammable and are backed by Life Orb. Seed Flare is often the best move to use unless a Steel-type that checks Shaymin-S is on the opposing team. However, be wary of the damage that Life Orb induces, as the recoil could reduce Shaymin-S's HP to the point that a priority user such as Yveltal, Scizor, or Extreme Killer Arceus could revenge kill it with ease. As a result, try to avoid priority users as much as possible, as Shaymin-S's frailty combined with Life Orb recoil can turn it into a high-priority target.</p>\n<h4>Team Options</h4>\n<p>As with any offensive threat, Shaymin-S can take advantage of entry hazards on the opponent's side of the field with its offensive pressure to rack up residual damage. Stealth Rock setters such as Landorus-T, Dialga, and Groudon in addition to Spikes setters such as Forretress and Ferrothorn will obviously help greatly in this regard. Entry hazards on Shaymin-S's side of the field are detrimental, so Defog users such as Arceus and Giratina as well as spinners like Forretress and Excadrill are beneficial partners. Even with Earth Power or Hidden Power Fire, Shaymin-S needs extra support against Steel-types. Therefore, Fire-types such as Ho-Oh, stallbreakers like Yveltal, and even Darkrai can assist Shaymin-S. VoltTurn is a safe method for bringing Shaymin-S in: Thundurus, Zekrom, and Genesect can grab momentum for the team and provide utility. Lastly, lures for Ground-types can bring Shaymin-S in safely; in particular, Heatran excels at this role with its 4x weakness to Ground-type attacks.</p>\n"
    },
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "seed_flare",
         "name": "Seed Flare"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "air_slash",
         "name": "Air Slash"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "earth_power",
         "name": "Earth Power"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "protect",
         "name": "Protect"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "Doubles",
       "alias": "doubles",
       "name": "Doubles"
      }
     ],
     "name": "Special Attacker",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 0.9,
       "hp": 1.0,
       "spatk": 1.0,
       "pdef": 1.0,
       "spe": 1.1
      },
      {
       "spdef": 1.0,
       "patk": 0.9,
       "hp": 1.0,
       "spatk": 1.1,
       "pdef": 1.0,
       "spe": 1.0
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Life Orb",
       "alias": "life_orb",
       "description": "Boosts power by 30%, user takes 10% recoil each turn it attacks."
      }
     ],
     "evconfigs": [
      {
       "spdef": 4,
       "patk": 0,
       "hp": 0,
       "spatk": 252,
       "pdef": 0,
       "spe": 252
      }
     ],
     "description": "<h4>Moves</h4>\n<p>Seed Flare is Shaymin-S's main STAB move for its monstrous power as well as an 80% chance to sharply lower the opponent's Special Defense. Air Slash is an excellent secondary STAB attack, which, when combined with Serene Grace, allows Shaymin-S to easily net flinches against the opponent. Though Air Slash's power is nothing to write home about, Shaymin's base 120 Special Attack can still let it tear apart many Fighting-, Bug-, and Grass-type Pokemon. Earth Power is very useful against Steel- and Fire-types, such as Heatran, who would otherwise wall this set. Protect is a staple in Doubles, and Shaymin-S is no exception; it allows Shaymin-S to scout for priority or status, avoid double targeting, and stall field effects such as Tailwind and Trick Room.</p>\n<h4>Set Details</h4>\n<p>The EV spread gives Shaymin-S the most power and Speed possible. While a Timid nature allows Shaymin-S to outspeed Thundurus and Choice Scarf Tyranitar, a Modest nature is recommended for the massive power it provides; for instance, Air Slash gets a guaranteed OHKO on 252 HP / 4 SpD Hitmontop, while Seed Flare gets a guaranteed OHKO on 0 HP / 0 SpD Landorus-T. Life Orb is the recommended item for Shaymin-S because the extra power boost is extremely valuable.</p>\n<h4>Usage Tips</h4>\n<p>With proper support, Shaymin-S can easily be used as a lead. It can also be brought out mid-game to punch holes in the opponent's team, or used later in the game as a late-game cleaner. Due to Shaymin-S's low defensive stats, it doesn't get many opportunities to switch-in, so try to keep as much offensive pressure on the opponent in order to avoid being KO'd. However, Shaymin-S can be switched in on a predicted Ground- or Water-type move, as well as Sleep Powder and Spore due to its Grass typing.</p>\n<h4>Team Options</h4>\n<p>Follow Me support is highly recommended, as drawing attacks away from Shaymin-S can easily extend its lifespan. Jirachi can use Follow Me and resists Flying-, Rock-, Poison-, and Ice-type moves, while Shaymin-S can take down most Ground- and Fire-types with Seed Flare and Earth Power, respectively. Hitmontop can use Wide Guard, an extremely helpful move, to help protect Shaymin-S from super effective moves like Rock Slide and Heat Wave. It can also use Quick Guard to protect Shaymin-S from attacks such as Talonflame's Brave Bird and Ice Shard. Fake Out support from the likes of Hitmontop and Scrafty is also helpful, as it can immobilize a threatening opponent for Shaymin-S. Offensive Fire-types like Mega Charizard and Heatran make great partners, as they appreciate Shaymin-S's ability to deal with bulky Water- and Rock-types. They also can take out the Steel-types that wall both of Shaymin-S's STAB attacks. Finally, Ground-types such as Excadrill, Landorus-T, and Garchomp appreciate Shaymin-S's Ground-type immunity, as it allows them to spam Earthquake more easily.</p>\n"
    },
    {
     "moveslots": [
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "substitute",
         "name": "Substitute"
        }
       ],
       "slot": 1
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "leech_seed",
         "name": "Leech Seed"
        }
       ],
       "slot": 2
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "seed_flare",
         "name": "Seed Flare"
        }
       ],
       "slot": 3
      },
      {
       "moves": [
        {
         "gen": "xy",
         "alias": "air_slash",
         "name": "Air Slash"
        }
       ],
       "slot": 4
      }
     ],
     "abilities": [],
     "tags": [
      {
       "gen": "xy",
       "shorthand": "Uber",
       "alias": "uber",
       "name": "Uber"
      }
     ],
     "name": "SubSeed",
     "natures": [
      {
       "spdef": 1.0,
       "patk": 0.9,
       "hp": 1.0,
       "spatk": 1.0,
       "pdef": 1.0,
       "spe": 1.1
      }
     ],
     "items": [
      {
       "gen": "xy",
       "name": "Leftovers",
       "alias": "leftovers",
       "description": "Heals 1/16 of max HP each turn."
      }
     ],
     "evconfigs": [
      {
       "spdef": 4,
       "patk": 0,
       "hp": 0,
       "spatk": 252,
       "pdef": 0,
       "spe": 252
      }
     ],
     "description": "<h4>Moves</h4>\n<p>With Substitute, Shaymin-S can take advantage of the switches it forces against bulky Water-types and Ground-types to shield itself from damage and status. Leech Seed works well with Substitute as the move increases Shaymin-S's survivability and replenishes its health against walls and tanks. With a high Base Power and an 80% chance to reduce the target's Special Defense stat by two stages, Seed Flare helps Shaymin-S bypass special walls. Air Slash completes Shaymin-S's STAB combination, has an incredibly handy chance to flinch the opponent, and can be a reliable move to spam when Substitute and Leech Seed have been used.</p>\n<h4>Set Details</h4>\n<p>A Timid nature and maximum Speed investment allow Shaymin-S to set up Substitutes quickly and proceed to spam Seed Flare. Due to Shaymin-S's slight reliance on Seed Flare to deal damage, maximum Special Attack investment is highly recommended. The remaining four EVs are placed into Special Defense to grant it a minuscule buffer against special attacks. Leftovers is the chosen item as it works well in tandem with Substitute and Leech Seed, passively restoring Shaymin-S's HP.</p>\n<h4>Usage Tips</h4>\n<p>One of the rules of thumb when using Substitute is to stay on top of predicted switches in order to gain setup opportunities. This is important as Shaymin-S can force out threats such as Groudon, Landorus-T, Gliscor, and even the mighty Kyogre, and set up a Substitute for free. Try using Substitute to scout for super effective coverage moves, and try to use it before using Leech Seed, as to avoid taking damage from attacks. When using the two moves, choose Substitute when you feel an offensive threat is coming in to scout out its set, and use Leech Seed if you think a defensive Pokemon or phazer is coming in so that Shaymin-S can score some passive damage. Shaymin-S's STAB moves have mediocre coverage, but they are very threatening and spammable, so fire away when needed. Try to avoid Steel-types, priority users, and possible phazers unless Shaymin-S has a Substitute up (for Steel-types and priority users) or can flee with Leech Seed in effect (against phazers).</p>\n<h4>Team Options</h4>\n<p>Though it is a rage-inducing soloist most of the time, Shaymin-S has many potential allies. The primary ones are VoltTurn users such as Thundurus, Genesect, and Zekrom, which can gain momentum and bring Shaymin-S in on a fleeing opponent. Groudon is a very solid partner for Shaymin-S, as it can set up Stealth Rock and check Ho-Oh, Skarmory, and Scizor with the right moves. Mega Gengar can trap Steel-types and cripple them with Taunt, leaving them vulnerable to Shaymin-S's shenanigans. Yveltal is a solid partner, as it can smash many common Steel-types and assist Shaymin-S with Taunt and U-turn. Heatran is a very helpful partner as it can provide Stealth Rock support as well as lure out Ground-type attacks and Pokemon for Shaymin-S to switch in and set up on. Entry hazard setters such as Forretress, Ferrothorn, Dialga, and Landorus-T are also crucial to Shaymin-S's success, as Stealth Rock and/or Spikes can allow it to finish off and defeat support Arceus formes and Ho-Oh. Entry hazard removal is equally important, as Shaymin-S wants to switch in as much as it can, so Defog users such as Arceus and Giratina and spinners such as Excadrill and Forretress can help out in this regard. Shaymin-S can support the aforementioned teammates with Leech Seed to increase their recovery and longevity.</p>\n"
    }
   ],
   "alias": "shaymin-sky",
   "name": "Shaymin-Sky",
   "genfamily": [
    {
     "gen": "bw",
     "alias": "shaymin-sky"
    },
    {
     "gen": "dp",
     "alias": "shaymin-sky"
    },
    {
     "gen": "xy",
     "alias": "shaymin-sky"
    }
   ],
   "moves": [
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 0,
     "alias": "aromatherapy",
     "name": "Aromatherapy",
     "description": "Cures status on the user's team.",
     "pp": 5,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "bullet_seed",
     "name": "Bullet Seed",
     "description": "Hits 2-5 times in one turn.",
     "pp": 30,
     "power": 25
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "confide",
     "name": "Confide",
     "description": "Lowers the target's Special Attack by 1 stage.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "covet",
     "name": "Covet",
     "description": "Steals target's item.",
     "pp": 25,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "fairy",
      "name": "Fairy"
     },
     "accuracy": 100,
     "alias": "dazzling_gleam",
     "name": "Dazzling Gleam",
     "description": "Deals damage to all adjacent foes.",
     "pp": 10,
     "power": 80
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "defense_curl",
     "name": "Defense Curl",
     "description": "Boosts Defense by 1 stage.",
     "pp": 40,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "double_team",
     "name": "Double Team",
     "description": "Boosts evasion by 1 stage.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "ground",
      "name": "Ground"
     },
     "accuracy": 100,
     "alias": "earth_power",
     "name": "Earth Power",
     "description": "10% chance to lower Special Defense by 1 stage.",
     "pp": 10,
     "power": 90
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "endeavor",
     "name": "Endeavor",
     "description": "Lowers the target's HP to the user's HP.",
     "pp": 5,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "endure",
     "name": "Endure",
     "description": "The user always survives with at least 1 HP.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "energy_ball",
     "name": "Energy Ball",
     "description": "10% chance to lower Special Defense by 1 stage.",
     "pp": 10,
     "power": 90
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "facade",
     "name": "Facade",
     "description": "Has 140 Base Power when burned, paralyzed, or poisoned.",
     "pp": 20,
     "power": 70
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "flash",
     "name": "Flash",
     "description": "Lowers foe's accuracy 1 stage.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "frustration",
     "name": "Frustration",
     "description": "No additional effect.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "giga_drain",
     "name": "Giga Drain",
     "description": "Leeches 50% damage.",
     "pp": 10,
     "power": 75
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 90,
     "alias": "giga_impact",
     "name": "Giga Impact",
     "description": "User cannot move next turn.",
     "pp": 5,
     "power": 150
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "grass_knot",
     "name": "Grass Knot",
     "description": "Deals damage based on the foe's weight.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 55,
     "alias": "grass_whistle",
     "name": "Grass Whistle",
     "description": "Puts the foe to sleep.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "growth",
     "name": "Growth",
     "description": "Boosts Attack and Special Attack by one stage. Boosts Attack and Special Attack by two stages in bright sunlight.",
     "pp": 40,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "headbutt",
     "name": "Headbutt",
     "description": "30% chance to flinch the target.",
     "pp": 15,
     "power": 70
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 0,
     "alias": "healing_wish",
     "name": "Healing Wish",
     "description": "KOs the user and heals the next Pokemon in.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "bug",
      "name": "Bug"
     },
     "accuracy": 100,
     "alias": "hidden_power_bug",
     "name": "Hidden Power Bug",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "dark",
      "name": "Dark"
     },
     "accuracy": 100,
     "alias": "hidden_power_dark",
     "name": "Hidden Power Dark",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "dragon",
      "name": "Dragon"
     },
     "accuracy": 100,
     "alias": "hidden_power_dragon",
     "name": "Hidden Power Dragon",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "electric",
      "name": "Electric"
     },
     "accuracy": 100,
     "alias": "hidden_power_electric",
     "name": "Hidden Power Electric",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "fighting",
      "name": "Fighting"
     },
     "accuracy": 100,
     "alias": "hidden_power_fighting",
     "name": "Hidden Power Fighting",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "fire",
      "name": "Fire"
     },
     "accuracy": 100,
     "alias": "hidden_power_fire",
     "name": "Hidden Power Fire",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "flying",
      "name": "Flying"
     },
     "accuracy": 100,
     "alias": "hidden_power_flying",
     "name": "Hidden Power Flying",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "ghost",
      "name": "Ghost"
     },
     "accuracy": 100,
     "alias": "hidden_power_ghost",
     "name": "Hidden Power Ghost",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "hidden_power_grass",
     "name": "Hidden Power Grass",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "ground",
      "name": "Ground"
     },
     "accuracy": 100,
     "alias": "hidden_power_ground",
     "name": "Hidden Power Ground",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "ice",
      "name": "Ice"
     },
     "accuracy": 100,
     "alias": "hidden_power_ice",
     "name": "Hidden Power Ice",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "poison",
      "name": "Poison"
     },
     "accuracy": 100,
     "alias": "hidden_power_poison",
     "name": "Hidden Power Poison",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 100,
     "alias": "hidden_power_psychic",
     "name": "Hidden Power Psychic",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "rock",
      "name": "Rock"
     },
     "accuracy": 100,
     "alias": "hidden_power_rock",
     "name": "Hidden Power Rock",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "steel",
      "name": "Steel"
     },
     "accuracy": 100,
     "alias": "hidden_power_steel",
     "name": "Hidden Power Steel",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "water",
      "name": "Water"
     },
     "accuracy": 100,
     "alias": "hidden_power_water",
     "name": "Hidden Power Water",
     "description": "Type is based on the user's IVs.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 90,
     "alias": "hyper_beam",
     "name": "Hyper Beam",
     "description": "User cannot move next turn.",
     "pp": 5,
     "power": 150
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "last_resort",
     "name": "Last Resort",
     "description": "Can only be used if all other moves have been used once.",
     "pp": 5,
     "power": 140
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 90,
     "alias": "leech_seed",
     "name": "Leech Seed",
     "description": "Leeches 1/8 of the target's HP each turn.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "lucky_chant",
     "name": "Lucky Chant",
     "description": "Blocks critical hits for 5 turns.",
     "pp": 30,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 0,
     "alias": "magical_leaf",
     "name": "Magical Leaf",
     "description": "Ignores accuracy modifiers.",
     "pp": 20,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "ground",
      "name": "Ground"
     },
     "accuracy": 100,
     "alias": "mud-slap",
     "name": "Mud-Slap",
     "description": "Lowers accuracy by 1 stage.",
     "pp": 10,
     "power": 20
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "natural_gift",
     "name": "Natural Gift",
     "description": "Power and type depends on the user's held Berry.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "nature_power",
     "name": "Nature Power",
     "description": "Attack changes based on terrain.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "protect",
     "name": "Protect",
     "description": "Prevents anything from working on the user that turn.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "psych_up",
     "name": "Psych Up",
     "description": "Copies the foe's stat changes.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 100,
     "alias": "psychic",
     "name": "Psychic",
     "description": "10% chance to lower Special Defense 1 stage.",
     "pp": 10,
     "power": 90
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 0,
     "alias": "rest",
     "name": "Rest",
     "description": "The user goes to sleep for two turns and restores all HP.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "return",
     "name": "Return",
     "description": "No additional effect.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "round",
     "name": "Round",
     "description": "Power doubles if a teammate uses Round in the same turn.",
     "pp": 15,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "safeguard",
     "name": "Safeguard",
     "description": "Blocks status conditions for 5 turns.",
     "pp": 25,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "secret_power",
     "name": "Secret Power",
     "description": "Effects vary with terrain.",
     "pp": 20,
     "power": 70
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "seed_bomb",
     "name": "Seed Bomb",
     "description": "No additional effect.",
     "pp": 15,
     "power": 80
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 85,
     "alias": "seed_flare",
     "name": "Seed Flare",
     "description": "40% chance to lower Special Defense by 2 stages.",
     "pp": 5,
     "power": 120
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "sleep_talk",
     "name": "Sleep Talk",
     "description": "Picks one of the user's moves at random. Can only be used while sleeping.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "snore",
     "name": "Snore",
     "description": "Can only be used while sleeping. 30% chance to flinch.",
     "pp": 15,
     "power": 50
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "solar_beam",
     "name": "Solar Beam",
     "description": "Charges up turn 1; attacks on turn 2.",
     "pp": 10,
     "power": 120
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "substitute",
     "name": "Substitute",
     "description": "Takes 1/4 the user's max HP to create a Substitute that takes damage for the user.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "fire",
      "name": "Fire"
     },
     "accuracy": 0,
     "alias": "sunny_day",
     "name": "Sunny Day",
     "description": "Summons sun for 5 turns.",
     "pp": 5,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 90,
     "alias": "swagger",
     "name": "Swagger",
     "description": "Confuses the target. Boosts its Attack by 2 stages.",
     "pp": 15,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "fairy",
      "name": "Fairy"
     },
     "accuracy": 75,
     "alias": "sweet_kiss",
     "name": "Sweet Kiss",
     "description": "Confuses the target.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 100,
     "alias": "sweet_scent",
     "name": "Sweet Scent",
     "description": "Lowers evasion by 1 stage.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Special",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "swift",
     "name": "Swift",
     "description": "Always hits.",
     "pp": 20,
     "power": 60
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "normal",
      "name": "Normal"
     },
     "accuracy": 0,
     "alias": "swords_dance",
     "name": "Swords Dance",
     "description": "Boosts Attack by 2 stages.",
     "pp": 20,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 0,
     "alias": "synthesis",
     "name": "Synthesis",
     "description": "Heals variably depending on the weather.",
     "pp": 5,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "poison",
      "name": "Poison"
     },
     "accuracy": 90,
     "alias": "toxic",
     "name": "Toxic",
     "description": "Inflicts intensifying poison on the target.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Non-Damaging",
     "type": {
      "gen": "xy",
      "alias": "grass",
      "name": "Grass"
     },
     "accuracy": 100,
     "alias": "worry_seed",
     "name": "Worry Seed",
     "description": "Changes the foe's ability to Insomnia.",
     "pp": 10,
     "power": 0
    },
    {
     "gen": "xy",
     "category": "Physical",
     "type": {
      "gen": "xy",
      "alias": "psychic",
      "name": "Psychic"
     },
     "accuracy": 90,
     "alias": "zen_headbutt",
     "name": "Zen Headbutt",
     "description": "20% chance to flinch.",
     "pp": 15,
     "power": 80
    }
   ],
   "family": {
    "preevo": {
     "gen": "xy",
     "alias": "shaymin",
     "name": "Shaymin"
    },
    "evos": [
     {
      "preevo": {
       "gen": "xy",
       "alias": "shaymin-sky",
       "name": "Shaymin-Sky"
      },
      "evos": []
     }
    ]
   },
   "alts": [
    {
     "patk": 103,
     "height": 0.4,
     "abilities": [
      {
       "gen": "xy",
       "name": "Serene Grace",
       "alias": "serene_grace",
       "description": "This Pokemon's secondary effect chances are doubled."
      }
     ],
     "alias": "shaymin-sky",
     "tags": [
      {
       "gen": "xy",
       "shorthand": "Uber",
       "alias": "uber",
       "name": "Uber"
      }
     ],
     "types": [
      {
       "gen": "xy",
       "alias": "flying",
       "name": "Flying"
      },
      {
       "gen": "xy",
       "alias": "grass",
       "name": "Grass"
      }
     ],
     "gkpower": 20,
     "spdef": 75,
     "hp": 100,
     "spatk": 120,
     "suffix": "",
     "pdef": 75,
     "weight": 5.2,
     "spe": 127,
     "effectives": [
      {
       "types": [
        {
         "gen": "xy",
         "alias": "ground",
         "name": "Ground"
        }
       ],
       "modifier": 0.0
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "grass",
         "name": "Grass"
        }
       ],
       "modifier": 0.25
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "fighting",
         "name": "Fighting"
        },
        {
         "gen": "xy",
         "alias": "water",
         "name": "Water"
        }
       ],
       "modifier": 0.5
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "bug",
         "name": "Bug"
        },
        {
         "gen": "xy",
         "alias": "dark",
         "name": "Dark"
        },
        {
         "gen": "xy",
         "alias": "dragon",
         "name": "Dragon"
        },
        {
         "gen": "xy",
         "alias": "electric",
         "name": "Electric"
        },
        {
         "gen": "xy",
         "alias": "fairy",
         "name": "Fairy"
        },
        {
         "gen": "xy",
         "alias": "ghost",
         "name": "Ghost"
        },
        {
         "gen": "xy",
         "alias": "normal",
         "name": "Normal"
        },
        {
         "gen": "xy",
         "alias": "psychic",
         "name": "Psychic"
        },
        {
         "gen": "xy",
         "alias": "steel",
         "name": "Steel"
        }
       ],
       "modifier": 1.0
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "fire",
         "name": "Fire"
        },
        {
         "gen": "xy",
         "alias": "flying",
         "name": "Flying"
        },
        {
         "gen": "xy",
         "alias": "poison",
         "name": "Poison"
        },
        {
         "gen": "xy",
         "alias": "rock",
         "name": "Rock"
        }
       ],
       "modifier": 2.0
      },
      {
       "types": [
        {
         "gen": "xy",
         "alias": "ice",
         "name": "Ice"
        }
       ],
       "modifier": 4.0
      }
     ]
    }
   ]
  }
 ]
}